In [1]:
#scrip more tech job description?
#!pip install wordcloud

In [2]:
import pandas as pd
import string

In [3]:
from nltk.corpus import stopwords 
from nltk.tokenize import word_tokenize
from nltk.stem import WordNetLemmatizer

In [4]:
from wordcloud import WordCloud, ImageColorGenerator
import matplotlib.pyplot as plt

In [5]:
import warnings
warnings.filterwarnings('ignore')

In [6]:
#load the data from the other directory
df=pd.read_csv('../raw_data/Train_rev1.csv')

In [7]:
#drop unusefull info
df=df.drop(columns=['Id',
                    'LocationRaw',
                    'LocationNormalized',
                    'ContractType',
                    'ContractTime',
                    'Company',
                    'SalaryRaw',
                    'SourceName'])
df

,Title,FullDescription,Category,SalaryNormalized
0,Engineering Systems Analyst,Engineering Systems Analyst Dorking Surrey Sal...,Engineering Jobs,25000
1,Stress Engineer Glasgow,Stress Engineer Glasgow Salary **** to **** We...,Engineering Jobs,30000
2,Modelling and simulation analyst,Mathematical Modeller / Simulation Analyst / O...,Engineering Jobs,30000
3,Engineering Systems Analyst / Mathematical Mod...,Engineering Systems Analyst / Mathematical Mod...,Engineering Jobs,27500
4,"Pioneer, Miser Engineering Systems Analyst","Pioneer, Miser Engineering Systems Analyst Do...",Engineering Jobs,25000
...,...,...,...,...
244763,TEACHER OF SCIENCE,Position: Qualified Teacher Subject/Specialism...,Teaching Jobs,22800
244764,TEACHER OF BUSINESS STUDIES AND ICT,Position: Qualified Teacher or NQT Subject/Spe...,Teaching Jobs,22800
244765,ENGLISH TEACHER,Position: Qualified Teacher Subject/Specialism...,Teaching Jobs,22800
244766,SUPPLY TEACHERS,Position: Qualified Teacher Subject/Specialism...,Teaching Jobs,22800
244767,Accountant,This entrepreneurial and growing private equit...,Teaching Jobs,42500

In [8]:
#drop null rows
df=df.dropna(axis=0, how='any')
#df

In [9]:
df.shape

(244767, 4)

In [10]:
# remove punctuation
def remove_punctuation(text):
    for punctuation in string.punctuation: 
        text = text.replace(punctuation, ' ') 
    return text

In [11]:
df['Title'] = df['Title'].astype(str).apply(remove_punctuation)
df['FullDescription'] = df['FullDescription'].astype(str).apply(remove_punctuation)
df

,Title,FullDescription,Category,SalaryNormalized
0,Engineering Systems Analyst,Engineering Systems Analyst Dorking Surrey Sal...,Engineering Jobs,25000
1,Stress Engineer Glasgow,Stress Engineer Glasgow Salary to We...,Engineering Jobs,30000
2,Modelling and simulation analyst,Mathematical Modeller Simulation Analyst O...,Engineering Jobs,30000
3,Engineering Systems Analyst Mathematical Mod...,Engineering Systems Analyst Mathematical Mod...,Engineering Jobs,27500
4,Pioneer Miser Engineering Systems Analyst,Pioneer Miser Engineering Systems Analyst Do...,Engineering Jobs,25000
...,...,...,...,...
244763,TEACHER OF SCIENCE,Position Qualified Teacher Subject Specialism...,Teaching Jobs,22800
244764,TEACHER OF BUSINESS STUDIES AND ICT,Position Qualified Teacher or NQT Subject Spe...,Teaching Jobs,22800
244765,ENGLISH TEACHER,Position Qualified Teacher Subject Specialism...,Teaching Jobs,22800
244766,SUPPLY TEACHERS,Position Qualified Teacher Subject Specialism...,Teaching Jobs,22800
244767,Accountant,This entrepreneurial and growing private equit...,Teaching Jobs,42500

In [12]:
#lower case of all context
def lowercase (text): 
    lowercased = text.lower() 
    return lowercased

In [13]:
df['Title'] = df['Title'].astype(str).apply(lowercase)
df['FullDescription'] = df['FullDescription'].astype(str).apply(lowercase)
df

,Title,FullDescription,Category,SalaryNormalized
0,engineering systems analyst,engineering systems analyst dorking surrey sal...,Engineering Jobs,25000
1,stress engineer glasgow,stress engineer glasgow salary to we...,Engineering Jobs,30000
2,modelling and simulation analyst,mathematical modeller simulation analyst o...,Engineering Jobs,30000
3,engineering systems analyst mathematical mod...,engineering systems analyst mathematical mod...,Engineering Jobs,27500
4,pioneer miser engineering systems analyst,pioneer miser engineering systems analyst do...,Engineering Jobs,25000
...,...,...,...,...
244763,teacher of science,position qualified teacher subject specialism...,Teaching Jobs,22800
244764,teacher of business studies and ict,position qualified teacher or nqt subject spe...,Teaching Jobs,22800
244765,english teacher,position qualified teacher subject specialism...,Teaching Jobs,22800
244766,supply teachers,position qualified teacher subject specialism...,Teaching Jobs,22800
244767,accountant,this entrepreneurial and growing private equit...,Teaching Jobs,42500

In [14]:
#remove numbers
def remove_numbers (text):
    words_only = ''.join([i for i in text if not i.isdigit()])
    return words_only

In [15]:
df['Title'] = df['Title'].astype(str).apply(remove_numbers)
df['FullDescription'] = df['FullDescription'].astype(str).apply(remove_numbers)
df

,Title,FullDescription,Category,SalaryNormalized
0,engineering systems analyst,engineering systems analyst dorking surrey sal...,Engineering Jobs,25000
1,stress engineer glasgow,stress engineer glasgow salary to we...,Engineering Jobs,30000
2,modelling and simulation analyst,mathematical modeller simulation analyst o...,Engineering Jobs,30000
3,engineering systems analyst mathematical mod...,engineering systems analyst mathematical mod...,Engineering Jobs,27500
4,pioneer miser engineering systems analyst,pioneer miser engineering systems analyst do...,Engineering Jobs,25000
...,...,...,...,...
244763,teacher of science,position qualified teacher subject specialism...,Teaching Jobs,22800
244764,teacher of business studies and ict,position qualified teacher or nqt subject spe...,Teaching Jobs,22800
244765,english teacher,position qualified teacher subject specialism...,Teaching Jobs,22800
244766,supply teachers,position qualified teacher subject specialism...,Teaching Jobs,22800
244767,accountant,this entrepreneurial and growing private equit...,Teaching Jobs,42500

In [16]:
#remove stopwords
from nltk.corpus import stopwords 
from nltk import word_tokenize

stop_words = set(stopwords.words('english')) 

# Create function
def remove_stopwords (text):
    tokenized = word_tokenize(text)
    without_stopwords = [word for word in tokenized if not word in stop_words]
    return without_stopwords

In [17]:
print(stop_words)

{'through', 'before', 'an', "you'll", 'did', 'to', 'than', 'won', 'haven', 'couldn', 'some', 'ours', 'd', 'now', 'ain', 'being', 'which', 'his', 'be', "you've", 'more', 'hadn', 'o', 'again', 'your', "haven't", "needn't", 'but', 'as', "hadn't", 'when', 's', 're', 'needn', "that'll", 'shouldn', 'whom', "wasn't", 'or', 'at', 'over', "should've", 'their', 'on', 'this', 'and', "you'd", 'because', 'for', 'down', 'our', 'what', 'further', 'are', 'after', 'too', "she's", "you're", 'they', 'while', "weren't", 'these', "didn't", 'her', 'am', 'wasn', 'how', 'yourselves', 'then', 'about', 'up', "won't", 'nor', 'no', 'off', 'don', 'between', 'here', 'who', 'mightn', 'mustn', 'ourselves', 'm', "doesn't", 'my', 'hers', 'is', 'same', 'isn', 'only', 'has', 'in', 'himself', 'have', 'not', 'by', "don't", 'with', "shan't", 'can', "isn't", 'out', "hasn't", 'doing', 'she', 'were', 'into', 'during', 'should', 'there', 'where', 'of', 'didn', 'wouldn', 'does', 'most', "it's", 'both', "couldn't", 'all', 'any', 'ma', 'each', 'other', 'that', 'been', 'such', 'i', 'hasn', 'a', 'just', 'if', "mustn't", 'had', 'once', 'so', 'him', 'few', 'yourself', 'until', 've', 'above', 'shan', 'will', 'the', 'herself', 'against', 't', 'from', 'was', 'doesn', 'themselves', 'itself', 'myself', 'aren', 'do', 'me', 'theirs', 'its', "wouldn't", 'yours', 'below', 'you', 'll', 'weren', 'having', 'it', 'those', 'why', 'y', 'he', 'own', "aren't", 'we', "mightn't", 'them', 'under', "shouldn't", 'very'}

In [18]:
df['Title'] = df['Title'].astype(str).apply(remove_stopwords)
df['FullDescription'] = df['FullDescription'].astype(str).apply(remove_stopwords)
df

,Title,FullDescription,Category,SalaryNormalized
0,"[engineering, systems, analyst]","[engineering, systems, analyst, dorking, surre...",Engineering Jobs,25000
1,"[stress, engineer, glasgow]","[stress, engineer, glasgow, salary, currently,...",Engineering Jobs,30000
2,"[modelling, simulation, analyst]","[mathematical, modeller, simulation, analyst, ...",Engineering Jobs,30000
3,"[engineering, systems, analyst, mathematical, ...","[engineering, systems, analyst, mathematical, ...",Engineering Jobs,27500
4,"[pioneer, miser, engineering, systems, analyst]","[pioneer, miser, engineering, systems, analyst...",Engineering Jobs,25000
...,...,...,...,...
244763,"[teacher, science]","[position, qualified, teacher, subject, specia...",Teaching Jobs,22800
244764,"[teacher, business, studies, ict]","[position, qualified, teacher, nqt, subject, s...",Teaching Jobs,22800
244765,"[english, teacher]","[position, qualified, teacher, subject, specia...",Teaching Jobs,22800
244766,"[supply, teachers]","[position, qualified, teacher, subject, specia...",Teaching Jobs,22800
244767,[accountant],"[entrepreneurial, growing, private, equity, ba...",Teaching Jobs,42500

In [19]:
#lemmatize
from nltk.stem import WordNetLemmatizer

def lemma(text):
    lemmatizer = WordNetLemmatizer() # Initiate lemmatizer
    lemmatized = [lemmatizer.lemmatize(word) for word in text] # Lemmatize
    lemmatized_string = " ".join(lemmatized)
    return lemmatized_string

In [20]:
df['Title'] = df['Title'].astype(str).apply(lemma)
df['FullDescription'] = df['FullDescription'].astype(str).apply(lemma)
df

,Title,FullDescription,Category,SalaryNormalized
0,"[ ' e n g i n e e r i n g ' , ' s y s t e m ...","[ ' e n g i n e e r i n g ' , ' s y s t e m ...",Engineering Jobs,25000
1,"[ ' s t r e s s ' , ' e n g i n e e r ' , ...","[ ' s t r e s s ' , ' e n g i n e e r ' , ...",Engineering Jobs,30000
2,"[ ' m o d e l l i n g ' , ' s i m u l a t i ...","[ ' m a t h e m a t i c a l ' , ' m o d e l ...",Engineering Jobs,30000
3,"[ ' e n g i n e e r i n g ' , ' s y s t e m ...","[ ' e n g i n e e r i n g ' , ' s y s t e m ...",Engineering Jobs,27500
4,"[ ' p i o n e e r ' , ' m i s e r ' , ' e ...","[ ' p i o n e e r ' , ' m i s e r ' , ' e ...",Engineering Jobs,25000
...,...,...,...,...
244763,"[ ' t e a c h e r ' , ' s c i e n c e ' ]","[ ' p o s i t i o n ' , ' q u a l i f i e d ...",Teaching Jobs,22800
244764,"[ ' t e a c h e r ' , ' b u s i n e s s ' , ...","[ ' p o s i t i o n ' , ' q u a l i f i e d ...",Teaching Jobs,22800
244765,"[ ' e n g l i s h ' , ' t e a c h e r ' ]","[ ' p o s i t i o n ' , ' q u a l i f i e d ...",Teaching Jobs,22800
244766,"[ ' s u p p l y ' , ' t e a c h e r s ' ]","[ ' p o s i t i o n ' , ' q u a l i f i e d ...",Teaching Jobs,22800
244767,[ ' a c c o u n t a n t ' ],"[ ' e n t r e p r e n e u r i a l ' , ' g r ...",Teaching Jobs,42500

In [21]:
df['Category'].value_counts()

IT Jobs                             38483
Engineering Jobs                    25174
Accounting & Finance Jobs           21846
Healthcare & Nursing Jobs           21075
Sales Jobs                          17272
Other/General Jobs                  17055
Teaching Jobs                       12637
Hospitality & Catering Jobs         11351
PR, Advertising & Marketing Jobs     8854
Trade & Construction Jobs            8837
HR & Recruitment Jobs                7713
Admin Jobs                           7614
Retail Jobs                          6584
Customer Services Jobs               6063
Legal Jobs                           3939
Manufacturing Jobs                   3765
Logistics & Warehouse Jobs           3633
Social work Jobs                     3455
Consultancy Jobs                     3263
Travel Jobs                          3126
Scientific & QA Jobs                 2489
Charity & Voluntary Jobs             2332
Energy, Oil & Gas Jobs               2255
Creative & Design Jobs               1605
Maintenance Jobs                     1542
Graduate Jobs                        1331
Property Jobs                        1038
Domestic help & Cleaning Jobs         291
Part time Jobs                        145
Name: Category, dtype: int64

In [22]:
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import MultinomialNB
#compare MultinomialNB GaussianNB
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.model_selection import cross_validate
from sklearn.metrics import accuracy_score, f1_score, precision_score

In [23]:
#predict title
vectorizer = TfidfVectorizer()

X = vectorizer.fit_transform(df['FullDescription'])
y = df['Title']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state = 0)
model = MultinomialNB()
model.fit(X_train, y_train)

y_pred=model.predict(X_test)

print(accuracy_score(y_test,y_pred))

ValueError: empty vocabulary; perhaps the documents only contain stop words

In [ ]:
X

In [ ]:
y_pred

In [ ]:
#predict category

#compare TfidfVectorizer vs CountVectorizer


#X = vectorizer.fit_transform(df['FullDescription'])
#y = df['Category']
#y = df['SalaryNormalized']

In [ ]:
#predict category
X = vectorizer.fit_transform(df['FullDescription'])
y = df['Category']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state = 0)
model = MultinomialNB()
model.fit(X_train, y_train)

y_pred=model.predict(X_test)

print(accuracy_score(y_test,y_pred))

In [ ]:
#predict salary
X = vectorizer.fit_transform(df['FullDescription'])
y = df['SalaryNormalized']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state = 0)
model = MultinomialNB()
model.fit(X_train, y_train)

y_pred=model.predict(X_test)

print(accuracy_score(y_test,y_pred))

In [ ]:
#describe the most frequent word in such category

def title_keyword(category):
    wordcloud = WordCloud(
                              background_color='white',
                              #stopwords=stop_words,
                              max_words=30,
                              max_font_size=60, 
                              random_state=42
                             ).generate(str(df.loc[df['Category']==category,'FullDescription']))
    print(wordcloud)
    fig = plt.figure(1)
    plt.imshow(wordcloud)
    plt.axis('off')
    plt.show()

In [ ]:
title_keyword('it jobs')

In [ ]:
skill_list = [
    '.NET', '.NET Core', 'Active Directory', 'AI', 'Algorithms', 'Android',
    'Angular', 'Ansible', 'APIs', 'AutoCAD', 'Automated Testing', 'AWS',
    'Azure', 'BDD', 'Big Data', 'Business Intelligence', 'C', 'C#', 'C++',
    'CAD', 'CD', 'Cisco', 'Cloud Platforms', 'Code Reviews', 'Confluence',
    'Continuous Integration', 'CRM', 'CSS', 'Data Analysis', 'Data Modeling',
    'Data Science', 'Data Visualization', 'Data Warehouse', 'Database Design',
    'Design Patterns', 'DevOps', 'DNS', 'Docker', 'ETL', 'Firewalls',
    'FOR EMPLOYERS', 'GCP', 'Git', 'GitHub', 'Go', 'Google Analytics',
    'Graphic design', 'HTML', 'Illustrator', 'InDesign', 'Java', 'JavaScript',
    'Jenkins', 'Jira', 'Kanban', 'Kubernetes', 'Linux', 'Machine Learning',
    'Microservices', 'MongoDB', 'MS Project', 'MySQL', 'Network Switches',
    'Node.js', 'NoSQL', 'OO', 'Photoshop', 'PHP', 'Pivot Tables', 'Power BI',
    'PowerShell', 'PRINCE2', 'Python', 'R', 'React', 'RESTful APIs', 'Revit',
    'SaaS', 'Salesforce', 'SAP', 'Scripting Language', 'Scrum', 'SEO',
    'SharePoint', 'SOLID', 'SQL Server', 'Tableau', 'TDD', 'Terraform',
    'TypeScript', 'UI', 'Unit Testing', 'Unix', 'UX', 'Version Control',
    'Virtualization', 'VMware', 'Vue.js', 'Web Services'
]
#skills need to lower case and remove comma

In [ ]:
skill_list = list(map(lowercase, skill_list))
skill_list = list(map(remove_numbers, skill_list))
skill_list = list(map(remove_punctuation, skill_list))
#df['Title'] = df['Title'].apply(remove_numbers)
skill_list